Templates/external_disc_mrf_steady/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform {{ k }};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform {{ k }};
    }

    outlet
    {
        type            zeroGradient;
    }

    tunnel
    {
        type            slip;
    }

    disc
    {
        type            kqRWallFunction;
        value           uniform {{ k }};
    }
}

// ************************************************************************* //
