Templates/external_disc_mrf_steady/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;

// Dial: Controlled by C# (iteration count for steady-state convergence)
endTime         {{ max_iterations }};
deltaT          1;
writeControl    timeStep;

// Dial: Controlled by C# (snapshot frequency)
writeInterval   {{ write_interval }};
purgeWrite      3;
writeFormat     ascii;
writePrecision  7;
writeCompression no;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;

        patches         (disc);
        rho             rhoInf;
        rhoInf          1.225; // Standard air density (kg/m3)

        // Reference values from study parameters
        magUInf         {{ mag_u_inf }};
        lRef            {{ disc_diameter }};
        Aref            {{ aref }};

        // Direction vectors (Standard wind tunnel orientation)
        dragDir         (1 0 0);
        liftDir         (0 1 0);
        pitchAxis       (0 0 1);
        CofR            (0 0 0); // Center of Rotation at CAD origin
    }
}

// ************************************************************************* //
